

export const UpdateHistory = [
    {
        date : "2026/6/25",
        info : [
            "新增【对局记录】功能：该功能会快捷记录你的对局。你可以搜索相关玩家的对局，侧栏也可以快捷检索自己的所有对局记录。点击对局记录后即可回到对局。",
            "修复了【公民凯恩】、【迷魂记】等牌不能撤回评论的问题。",
            "修复了人物牌在自动结算操作后可以撤回的问题。",
            "修复了没有bug的bug。",
        ]
    },
    {
        date : "2026/6/18",
        info : [
            "修复异形的部分交互异常问题。",
        ]
    },
    {
        date : "2026/6/15",
        info : [
            "新增【自定义用户名】功能：可通过右上角设置；【匿名】模式下游戏过程中依然隐藏用户名；数据统计会包含用户名。",
            "【美学大奖】与实体版本同步：每5声望，额外获得1声望。",
            "修复了多个地区结算时名次分发异常问题。",
            "修复了【蓝】的选择显示异常问题。",
            "修复了部分情况下更新流派扩流派导致流派消失的问题。",
            "修缮了部分文本不统一的问题。",
            "卡牌调整：【安杰伊·瓦依达】出牌+1存款。【让·维果】出牌+1声望（原+3）。【埃米尔·库斯图里卡】重做。",
            "流派调整：【明星制】【巨片】【布拉格电影学院】重做。【思想电影/新思想电影】计分修改。",
            "修复了没有bug的bug。",
        ]
    },
    {
        date : "2026/6/6",
        info : [
            "新增【地区聚焦】功能：可聚焦于某个地区，缩略其他地区信息，仅显示某个地区的具体信息。可使用【A】【D】快捷切换地区。",
            "对局数据优化：区分了4人局和3人局的回合、位次统计；工美胜率统计新增对局环境统计划分。",
            "【新好莱坞电影】与实体版本同步：每回合开始时，选择一项：①+1竞争力。②争夺1次。",
            "修缮了部分文本不统一的问题。",
            "卡牌调整：【斯坦利·库布里克】【让·维果】。",
            "流派调整：【室内剧电影】【明星制】【电影实验派】。",
            "修复了没有bug的bug。",
        ]
    },
    /*
    {
        date : "2026/5/9",
        info : [
            "调整了【历劫佳人】、【新电影】、【布拉格电影学派】、【巨片】、【武侠电影】、【明星制】。",
            "新增了部分bug。",
            "修复了没有bug的bug。"
        ]
    },
    {
        date : "2026/4/5",
        info : [
            "调整了婴儿的午餐、让-皮埃尔·梅尔维尔、侯孝贤、新电影、黄土地、剧影派等卡牌。",
            "新增【匿名随机】选项：游戏开始时，再随机顺位并分配随机公司名。",
            "修复了第一回合的计时计入房主的问题，游戏结束时计时不停止的问题。"
        ]
    },
    {
        date : "2026/4/2",
        info : [
            "新增了时间显示、局内统计（观战可实时看见）。",
            "修复了计时器时间归属计算错误的问题。",
            "修复了分数界面消失的问题。"
        ]
    },
    {
        date : "2026/4/1",
        info : [
            "新增了【电影百年股票扩】？"
        ]
    },
    {
        date: "2026/3/20",
        info: [
            "调整了侯孝贤、黄土地、让·维果。",
            "修复了【乱世光影】人物牌没有正常计分的问题。",
            "修复了【第三电影】使用行动力抽牌没有正常计入的问题。"
        ]
    },
    {
        date : "2026/3/16",
        info : [
            "更新卡表页面、数据页面。",
            "暂时隐藏【明星制】、【武侠电影】。"
        ]
    },
    {
        date : "2026/3/11",
        info : [
            "新增DIY【乱世光影扩】，选择后扩展卡牌将加入牌池。卡表ID以6开头的23张卡牌即为扩展卡牌。",
        ]
    },
    {
        date : "2026/2/27",
        info : [
            "调整了【剧影派】、【巨片】、【明星制】、【布拉格电影学派】，移除了【巧克力学派】，新增【奶油派】代替。",
        ]
    },
    {
        date : "2026/2/19",
        info : [
            "新增【每时代2个】的流派扩简化模式。",
            "修复了【玛萨拉电影】在突破时触发其他效果的冲突问题。",
            "修复了【传世经典】的【自动xx】不触发部分流派特效的问题。",
        ]
    },
    {
        date : "2026/2/15",
        info : [
            "新增了二时代流派【明星制】、【室内剧电影】、【黑浪潮】、【武侠电影】。",
        ]
    }
    /*,
    {
        date : "2026/2/8",
        info : [
            "修复了新媒介文本与代码不符的问题。",
        ]
    },
    {
        date : "2026/2/6",
        info : [
            "新增三时代流派扩展：【布拉格电影学派】、【通心粉西部电影】、【巨片】、【剧影派】、【巧克力电影】。他们同样共享流派扩购买限制。",
        ]
    },
    /*
    {
        date : "2025/12/30",
        info : [
            "调整了【思想电影】",
            "禁用了【作者电影】",
        ]
    },
    {
        date : "2025/12/28",
        info : [
            "起名扩更新：",
            "【新思想电影】调整：【规模/行动力】从【4/3】调整回【5/2】",
            "新增流派【作者电影】：购买人物牌后，+1行动力，+1存款，+1声望。你的人物牌的【指定一个本地区没有制片厂的公司】，改为【指定所有本地区没有制片厂的公司（除你以外）。】",
            "新增流派【思想电影】：工业/美学等级为8的奖励效果改为【+1声望】/【+1资源】。如果你的工业等级和美学等级差值小于等于2：每当你触发一次工业奖励或美学奖励后，额外触发一次"
        ]
    },
    {
        date : "2025/12/13",
        info : [
            "修复了【法国印象派】建造建筑时，没有正常+1资源的问题。",
            "修复了【新思想电影】的双倍厂效判定中，没有正确计算等级差值的问题。"
        ]
    },
    {
        date : "2025/12/12",
        info : [
            "【新思想电影】调整：【规模/行动力】从【5/2】调整至【4/3】，并且差值条件从【1】调整至【2】。",
            "【电影实验派】调整：【需求】从【1/0/6】调整至【1/0/5】，并且新增效果【购买东欧流派时，+1工业等级，+1存款，+1声望】。"
        ]
    },
    */
]