

export const UpdateHistory = [
    {
        date : "2026/2/15",
        info : [
            "新增了二时代流派【明星制】、【室内剧电影】、【黑浪潮】、【武侠电影】。",
        ]
    },
    {
        date : "2026/2/8",
        info : [
            "修复了新媒介文本与代码不符的问题。",
        ]
    },
    {
        date : "2026/2/6",
        info : [
            "新增三时代流派扩展：【布拉格电影学派】、【通心粉西部电影】、【巨片】、【剧影派】、【巧克力电影】。他们同样共享流派扩购买限制。",
        ]
    },
    {
        date : "2025/12/30",
        info : [
            "调整了【思想电影】",
            "禁用了【作者电影】",
        ]
    },
    /*
    {
        date : "2025/12/28",
        info : [
            "起名扩更新：",
            "【新思想电影】调整：【规模/行动力】从【4/3】调整回【5/2】",
            "新增流派【作者电影】：购买人物牌后，+1行动力，+1存款，+1声望。你的人物牌的【指定一个本地区没有制片厂的公司】，改为【指定所有本地区没有制片厂的公司（除你以外）。】",
            "新增流派【思想电影】：工业/美学等级为8的奖励效果改为【+1声望】/【+1资源】。如果你的工业等级和美学等级差值小于等于2：每当你触发一次工业奖励或美学奖励后，额外触发一次"
        ]
    },
    {
        date : "2025/12/13",
        info : [
            "修复了【法国印象派】建造建筑时，没有正常+1资源的问题。",
            "修复了【新思想电影】的双倍厂效判定中，没有正确计算等级差值的问题。"
        ]
    },
    {
        date : "2025/12/12",
        info : [
            "【新思想电影】调整：【规模/行动力】从【5/2】调整至【4/3】，并且差值条件从【1】调整至【2】。",
            "【电影实验派】调整：【需求】从【1/0/6】调整至【1/0/5】，并且新增效果【购买东欧流派时，+1工业等级，+1存款，+1声望】。"
        ]
    },
    */
]